<a href="https://colab.research.google.com/github/NickZaga1/Fecap/blob/main/Pr%C3%A9_Processamento_de_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [7]:
dic = {'Nome': ['Isa', 'Nicolas', 'Pobre'],
       'Idade':['19', '28', '0'],
       'Salário':['19000', '5000', '100'],
       'Gênero':['F', 'M', 'honda4porta'],
       'Cargo':['Gerente', 'Supervisor', '']
}

In [8]:
df = pd.DataFrame(dic)
df

      Nome Idade Salário       Gênero       Cargo
0      Isa    19   19000            F     Gerente
1  Nicolas    28    5000            M  Supervisor
2    Pobre     0     100  honda4porta

In [9]:
df.info

<bound method DataFrame.info of       Nome Idade Salário       Gênero       Cargo
0      Isa    19   19000            F     Gerente
1  Nicolas    28    5000            M  Supervisor
2    Pobre     0     100  honda4porta            >

In [11]:
df = pd.get_dummies(df, columns=['Gênero'])

In [12]:
df

      Nome Idade Salário       Cargo  Gênero_F  Gênero_M  Gênero_honda4porta
0      Isa    19   19000     Gerente         1         0                   0
1  Nicolas    28    5000  Supervisor         0         1                   0
2    Pobre     0     100                     0         0                   1

In [15]:
df = df.drop(columns=['Cargo'])
df

      Nome Idade Salário  Gênero_F  Gênero_M  Gênero_honda4porta
0      Isa    19   19000         1         0                   0
1  Nicolas    28    5000         0         1                   0
2    Pobre     0     100         0         0                   1